presentation.tex
% Created 2020-12-26 Sat 21:28
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{tae}
\date{\today}
\title{Lecture 1. Introduction to MATLAB}
\hypersetup{
 pdfauthor={tae},
 pdftitle={Lecture 1. Introduction to MATLAB},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4.4)},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Instructor}
\label{sec:orgdf4a16d}
\begin{itemize}
\item Tae Eun Kim, Senior Lecturer
\item B.S. in economics and mathematics (Northwestern University)
\item Ph.D. in mathematics (The Ohio State University)
\end{itemize}

\section{Math 3607}
\label{sec:org4537c41}
Beginning Scientific Computing
\begin{itemize}
\item Introduction to MATLAB: CS class
\item Introduction to Numerical Analysis: math class
\begin{itemize}
\item lots of linear algebra (matrices, vector spaces, etc.)
\end{itemize}
\end{itemize}

\section{Assignments}
\label{sec:orgb3c72db}
\begin{itemize}
\item Weekly Homework (matlab programming + mathematical questions)
\begin{itemize}
\item numerical calculation and confirmation using MATLAB
\item graphical representation
\item analysis to be done by hand and, at times, simple proofs at the level of undergraduate linear algebra or calculus
\end{itemize}
\item Weekly Responses
\begin{itemize}
\item Carmen quizzes to check understanding of key concepts and techniques
\item feedback to learning experience
\item communication channel
\end{itemize}
\end{itemize}
\end{document}
